test/multiphase/multiphaseEulerFoam/populationBalance/negativeDrift/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type populationBalanceMultiphaseSystem;

phases (air water);

referencePhase water;

populationBalances (bubbles);

air
{
    type            pureIsothermalPhaseModel;
    diameterModel   velocityGroup;
    velocityGroupCoeffs
    {
        populationBalance   bubbles;

        shapeModel          spherical;

        sizeGroups
        (
            f0 {dSph 1.000; value 0.0000;}
            f1 {dSph 1.074; value 0.0000;}
            f2 {dSph 1.147; value 0.0000;}
            f3 {dSph 1.221; value 0.0000;}
            f4 {dSph 1.294; value 0.0000;}
            f5 {dSph 1.368; value 0.0000;}
            f6 {dSph 1.441; value 0.0000;}
            f7 {dSph 1.515; value 0.0000;}
            f8 {dSph 1.588; value 0.0000;}
            f9 {dSph 1.662; value 0.0000;}
            f10{dSph 1.735; value 0.0000;}
            f11{dSph 1.809; value 0.0000;}
            f12{dSph 1.882; value 0.0000;}
            f13{dSph 1.956; value 0.0000;}
            f14{dSph 2.029; value 0.0000;}
            f15{dSph 2.103; value 0.0000;}
            f16{dSph 2.176; value 0.0000;}
            f17{dSph 2.250; value 0.0000;}
            f18{dSph 2.323; value 0.0000;}
            f19{dSph 2.397; value 0.0000;}
            f20{dSph 2.470; value 0.1989;}
            f21{dSph 2.544; value 0.2304;}
            f22{dSph 2.617; value 0.2656;}
            f23{dSph 2.691; value 0.3051;}
            f24{dSph 2.764; value 0.0000;}
            f25{dSph 2.838; value 0.0000;}
            f26{dSph 2.911; value 0.0000;}
            f27{dSph 2.985; value 0.0000;}
            f28{dSph 3.058; value 0.0000;}
        );
    }

    residualAlpha   1e-6;
}

water
{
    type            pureIsothermalPhaseModel;
    diameterModel   none;

    residualAlpha   1e-6;
}

populationBalanceCoeffs
{
    bubbles
    {
        continuousPhase water;

        coalescenceModels
        ();

        binaryBreakupModels
        ();

        breakupModels
        ();

        driftModels
        (
            constant
            {
                rate    -1;
            }
        );

        nucleationModels
        ();
    }
}

blending
{
    default
    {
        type            continuous;
        phase           water;
    }
}

surfaceTension
{}

interfaceCompression
{}

drag
{}

virtualMass
{}

heatTransfer
{}

phaseTransfer
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

// ************************************************************************* //
